Revit 2027 API
PipePressureDropData.Friction Property
 The friction of the pipe. Units: (kg/(ft²·s²)).
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Friction { get; set; }
Public Property Friction As Double
	Get
	Set
public:
property double Friction {
	double get ();
	void set (double value);
}
member Friction : float with get, set
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace